; domain
(define (domain flow)

    (:requirements :strips :typing)

    (:types
        color
        location
    )

    (:predicates
        ;The finger is off the board, we can begin any flow
        (offboard)
        ; the location has no color
        (empty ?l - location)
        ; negation of empty predicate
        (not-empty ?l - location)
        ; the location l has color c
        (color-at ?l - location ?c - color )
        ; l1 is an adjacent location to l2
        (adjacent ?l1 - location ?l2 - location)
        ; l is the end point for the flow of color c
        (flow-end ?l - location ?c - color)
        ; the player is at l1 drawing a flow of color c
        (flow-at ?l1 - location ?c - color)
        ; the flow for color c is completed
        (flow-complete ?c - color)
    )

    ;start the flow of color c
    (:action start
        :parameters (?l - location ?c - color)
        :precondition (and (offboard) (empty ?l) (flow-end ?l ?c)) 
        :effect (and (not (offboard)) (not (empty ?l)) (not-empty ?l) (flow-at ?l ?c) (color-at ?l ?c))
    )

    (:action move
        :parameters (?l1  ?l2 - location ?c - color)
        :precondition (and (flow-at ?l1 ?c) (empty ?l2) (adjacent ?l1 ?l2)) 
        :effect (and (not (flow-at ?l1 ?c)) (not (empty ?l2)) (flow-at ?l2 ?c) (not-empty ?l2) (color-at ?l2 ?c))
    )

    ;end the flow of color c
    (:action finish
        :parameters (?l1  ?l2 - location ?c - color)
        :precondition (and (flow-at ?l1 ?c) (empty ?l2) (flow-end ?l2 ?c) (adjacent ?l1 ?l2)) 
        :effect (and (not (flow-at ?l1 ?c)) (not (empty ?l2)) (not-empty ?l2) (offboard) (color-at ?l2 ?c) (flow-complete ?c))
    )
)

; problem
(define (problem flow_5_5) (:domain flow)
(:objects 
    red
	green
	blue
	yellow
	orange - color
    p_0_0
	p_0_1
	p_0_2
	p_0_3
	p_0_4
	p_1_0
	p_1_1
	p_1_2
	p_1_3
	p_1_4
	p_2_0
	p_2_1
	p_2_2
	p_2_3
	p_2_4
	p_3_0
	p_3_1
	p_3_2
	p_3_3
	p_3_4
	p_4_0
	p_4_1
	p_4_2
	p_4_3
	p_4_4 - location
)

(:init
    (offboard)
    (empty p_0_0)
	(empty p_0_1)
	(empty p_0_2)
	(empty p_0_3)
	(empty p_0_4)
	(empty p_1_0)
	(empty p_1_1)
	(empty p_1_2)
	(empty p_1_3)
	(empty p_1_4)
	(empty p_2_0)
	(empty p_2_1)
	(empty p_2_2)
	(empty p_2_3)
	(empty p_2_4)
	(empty p_3_0)
	(empty p_3_1)
	(empty p_3_2)
	(empty p_3_3)
	(empty p_3_4)
	(empty p_4_0)
	(empty p_4_1)
	(empty p_4_2)
	(empty p_4_3)
	(empty p_4_4)
    (adjacent p_0_0 p_1_0)
	(adjacent p_0_0 p_0_1)
	(adjacent p_0_1 p_1_1)
	(adjacent p_0_1 p_0_2)
	(adjacent p_0_1 p_0_0)
	(adjacent p_0_2 p_1_2)
	(adjacent p_0_2 p_0_3)
	(adjacent p_0_2 p_0_1)
	(adjacent p_0_3 p_1_3)
	(adjacent p_0_3 p_0_4)
	(adjacent p_0_3 p_0_2)
	(adjacent p_0_4 p_1_4)
	(adjacent p_0_4 p_0_3)
	(adjacent p_1_0 p_2_0)
	(adjacent p_1_0 p_1_1)
	(adjacent p_1_0 p_0_0)
	(adjacent p_1_1 p_2_1)
	(adjacent p_1_1 p_1_2)
	(adjacent p_1_1 p_0_1)
	(adjacent p_1_1 p_1_0)
	(adjacent p_1_2 p_2_2)
	(adjacent p_1_2 p_1_3)
	(adjacent p_1_2 p_0_2)
	(adjacent p_1_2 p_1_1)
	(adjacent p_1_3 p_2_3)
	(adjacent p_1_3 p_1_4)
	(adjacent p_1_3 p_0_3)
	(adjacent p_1_3 p_1_2)
	(adjacent p_1_4 p_2_4)
	(adjacent p_1_4 p_0_4)
	(adjacent p_1_4 p_1_3)
	(adjacent p_2_0 p_3_0)
	(adjacent p_2_0 p_2_1)
	(adjacent p_2_0 p_1_0)
	(adjacent p_2_1 p_3_1)
	(adjacent p_2_1 p_2_2)
	(adjacent p_2_1 p_1_1)
	(adjacent p_2_1 p_2_0)
	(adjacent p_2_2 p_3_2)
	(adjacent p_2_2 p_2_3)
	(adjacent p_2_2 p_1_2)
	(adjacent p_2_2 p_2_1)
	(adjacent p_2_3 p_3_3)
	(adjacent p_2_3 p_2_4)
	(adjacent p_2_3 p_1_3)
	(adjacent p_2_3 p_2_2)
	(adjacent p_2_4 p_3_4)
	(adjacent p_2_4 p_1_4)
	(adjacent p_2_4 p_2_3)
	(adjacent p_3_0 p_4_0)
	(adjacent p_3_0 p_3_1)
	(adjacent p_3_0 p_2_0)
	(adjacent p_3_1 p_4_1)
	(adjacent p_3_1 p_3_2)
	(adjacent p_3_1 p_2_1)
	(adjacent p_3_1 p_3_0)
	(adjacent p_3_2 p_4_2)
	(adjacent p_3_2 p_3_3)
	(adjacent p_3_2 p_2_2)
	(adjacent p_3_2 p_3_1)
	(adjacent p_3_3 p_4_3)
	(adjacent p_3_3 p_3_4)
	(adjacent p_3_3 p_2_3)
	(adjacent p_3_3 p_3_2)
	(adjacent p_3_4 p_4_4)
	(adjacent p_3_4 p_2_4)
	(adjacent p_3_4 p_3_3)
	(adjacent p_4_0 p_4_1)
	(adjacent p_4_0 p_3_0)
	(adjacent p_4_1 p_4_2)
	(adjacent p_4_1 p_3_1)
	(adjacent p_4_1 p_4_0)
	(adjacent p_4_2 p_4_3)
	(adjacent p_4_2 p_3_2)
	(adjacent p_4_2 p_4_1)
	(adjacent p_4_3 p_4_4)
	(adjacent p_4_3 p_3_3)
	(adjacent p_4_3 p_4_2)
	(adjacent p_4_4 p_3_4)
	(adjacent p_4_4 p_4_3)
    (flow-end p_0_0 red)
	(flow-end p_1_4 red)
	(flow-end p_1_3 green)
	(flow-end p_2_0 green)
	(flow-end p_2_1 blue)
	(flow-end p_2_4 blue)
	(flow-end p_3_3 yellow)
	(flow-end p_4_0 yellow)
	(flow-end p_3_4 orange)
	(flow-end p_4_1 orange)
)

(:goal (and
    ;(forall (?c - color) (flow-complete ?c))
    ;(forall (?l - location) (not-empty ?l))
    (flow-complete red)
	(flow-complete green)
	(flow-complete blue)
	(flow-complete yellow)
	(flow-complete orange)
    (not-empty p_0_0)
	(not-empty p_0_1)
	(not-empty p_0_2)
	(not-empty p_0_3)
	(not-empty p_0_4)
	(not-empty p_1_0)
	(not-empty p_1_1)
	(not-empty p_1_2)
	(not-empty p_1_3)
	(not-empty p_1_4)
	(not-empty p_2_0)
	(not-empty p_2_1)
	(not-empty p_2_2)
	(not-empty p_2_3)
	(not-empty p_2_4)
	(not-empty p_3_0)
	(not-empty p_3_1)
	(not-empty p_3_2)
	(not-empty p_3_3)
	(not-empty p_3_4)
	(not-empty p_4_0)
	(not-empty p_4_1)
	(not-empty p_4_2)
	(not-empty p_4_3)
	(not-empty p_4_4)
))

)

; plan
1. (start p_0_0 red)
   deleted: (offboard) (empty p_0_0)
   added: (not-empty p_0_0) (flow-at p_0_0 red) (color-at p_0_0 red)
   goals met: 1 of 30
2. (move p_0_0 p_0_1 red)
   deleted: (flow-at p_0_0 red) (empty p_0_1)
   added: (flow-at p_0_1 red) (not-empty p_0_1) (color-at p_0_1 red)
   goals met: 2 of 30
3. (move p_0_1 p_0_2 red)
   deleted: (flow-at p_0_1 red) (empty p_0_2)
   added: (flow-at p_0_2 red) (not-empty p_0_2) (color-at p_0_2 red)
   goals met: 3 of 30
4. (move p_0_2 p_0_3 red)
   deleted: (flow-at p_0_2 red) (empty p_0_3)
   added: (flow-at p_0_3 red) (not-empty p_0_3) (color-at p_0_3 red)
   goals met: 4 of 30
5. (move p_0_3 p_0_4 red)
   deleted: (flow-at p_0_3 red) (empty p_0_4)
   added: (flow-at p_0_4 red) (not-empty p_0_4) (color-at p_0_4 red)
   goals met: 5 of 30
6. (finish p_0_4 p_1_4 red)
   deleted: (flow-at p_0_4 red) (empty p_1_4)
   added: (not-empty p_1_4) (offboard) (color-at p_1_4 red) (flow-complete red)
   goals met: 7 of 30
7. (start p_4_0 yellow)
   deleted: (offboard) (empty p_4_0)
   added: (not-empty p_4_0) (flow-at p_4_0 yellow) (color-at p_4_0 yellow)
   goals met: 8 of 30
8. (move p_4_0 p_3_0 yellow)
   deleted: (flow-at p_4_0 yellow) (empty p_3_0)
   added: (flow-at p_3_0 yellow) (not-empty p_3_0) (color-at p_3_0 yellow)
   goals met: 9 of 30
9. (move p_3_0 p_3_1 yellow)
   deleted: (flow-at p_3_0 yellow) (empty p_3_1)
   added: (flow-at p_3_1 yellow) (not-empty p_3_1) (color-at p_3_1 yellow)
   goals met: 10 of 30
10. (move p_3_1 p_3_2 yellow)
   deleted: (flow-at p_3_1 yellow) (empty p_3_2)
   added: (flow-at p_3_2 yellow) (not-empty p_3_2) (color-at p_3_2 yellow)
   goals met: 11 of 30
11. (finish p_3_2 p_3_3 yellow)
   deleted: (flow-at p_3_2 yellow) (empty p_3_3)
   added: (not-empty p_3_3) (offboard) (color-at p_3_3 yellow) (flow-complete yellow)
   goals met: 13 of 30
12. (start p_2_0 green)
   deleted: (offboard) (empty p_2_0)
   added: (not-empty p_2_0) (flow-at p_2_0 green) (color-at p_2_0 green)
   goals met: 14 of 30
13. (move p_2_0 p_1_0 green)
   deleted: (flow-at p_2_0 green) (empty p_1_0)
   added: (flow-at p_1_0 green) (not-empty p_1_0) (color-at p_1_0 green)
   goals met: 15 of 30
14. (move p_1_0 p_1_1 green)
   deleted: (flow-at p_1_0 green) (empty p_1_1)
   added: (flow-at p_1_1 green) (not-empty p_1_1) (color-at p_1_1 green)
   goals met: 16 of 30
15. (move p_1_1 p_1_2 green)
   deleted: (flow-at p_1_1 green) (empty p_1_2)
   added: (flow-at p_1_2 green) (not-empty p_1_2) (color-at p_1_2 green)
   goals met: 17 of 30
16. (finish p_1_2 p_1_3 green)
   deleted: (flow-at p_1_2 green) (empty p_1_3)
   added: (not-empty p_1_3) (offboard) (color-at p_1_3 green) (flow-complete green)
   goals met: 19 of 30
17. (start p_4_1 orange)
   deleted: (offboard) (empty p_4_1)
   added: (not-empty p_4_1) (flow-at p_4_1 orange) (color-at p_4_1 orange)
   goals met: 20 of 30
18. (move p_4_1 p_4_2 orange)
   deleted: (flow-at p_4_1 orange) (empty p_4_2)
   added: (flow-at p_4_2 orange) (not-empty p_4_2) (color-at p_4_2 orange)
   goals met: 21 of 30
19. (move p_4_2 p_4_3 orange)
   deleted: (flow-at p_4_2 orange) (empty p_4_3)
   added: (flow-at p_4_3 orange) (not-empty p_4_3) (color-at p_4_3 orange)
   goals met: 22 of 30
20. (move p_4_3 p_4_4 orange)
   deleted: (flow-at p_4_3 orange) (empty p_4_4)
   added: (flow-at p_4_4 orange) (not-empty p_4_4) (color-at p_4_4 orange)
   goals met: 23 of 30
21. (finish p_4_4 p_3_4 orange)
   deleted: (flow-at p_4_4 orange) (empty p_3_4)
   added: (not-empty p_3_4) (offboard) (color-at p_3_4 orange) (flow-complete orange)
   goals met: 25 of 30
22. (start p_2_1 blue)
   deleted: (offboard) (empty p_2_1)
   added: (not-empty p_2_1) (flow-at p_2_1 blue) (color-at p_2_1 blue)
   goals met: 26 of 30
23. (move p_2_1 p_2_2 blue)
   deleted: (flow-at p_2_1 blue) (empty p_2_2)
   added: (flow-at p_2_2 blue) (not-empty p_2_2) (color-at p_2_2 blue)
   goals met: 27 of 30
24. (move p_2_2 p_2_3 blue)
   deleted: (flow-at p_2_2 blue) (empty p_2_3)
   added: (flow-at p_2_3 blue) (not-empty p_2_3) (color-at p_2_3 blue)
   goals met: 28 of 30
25. (finish p_2_3 p_2_4 blue)
   deleted: (flow-at p_2_3 blue) (empty p_2_4)
   added: (not-empty p_2_4) (offboard) (color-at p_2_4 blue) (flow-complete blue)
   goals met: 30 of 30
